<template>
  <div>
    <div v-if="single">
      <h1>{{ single.name }}</h1>
      <p>{{ single.detail }}</p>
    </div>
    {{ $route.params.id }}
  </div>
</template>

<script>
export default {
  data() {
    return {
      single: {},
      news: [
        {
          name: '1 Faol tadbirkorlik, innovatsion g‘oyalar va texnologiyalarni qo‘llab-quvvatlash yili” deb e’lon qilingan 2018-yilda mamlakatimizda iqtisodiyot, ijtimoiy soha va davlat boshqaruviga zamonaviy ilm-fan yutuqlari, innovatsion g‘oyalar va texnologiyalarni joriy etish bo‘yicha kompleks chora-tadbirlar amalga oshirildi. Qabul qilingan 2018-yilgi Davlat dasturini ro‘yobga chiqarish doirasida 21 trillion so‘m va 1 milliard AQSh dollariga teng 76 mingta loyiha amalga oshirildi.Obod qishloq” va “Obod mahalla” dasturlariga muvofiq 400 dan ortiq qishloq va mahallalarda munosib turmush sharoitlarini yaratishga qaratilgan qurilish va obodonlashtirish ishlariga 3 trillion so‘m mablag‘ yo‘naltirildi',
          id: 1,
          detail:
            '2 Ўзбекистон Республикаси Президенти Шавкат Мирзиёев “Ягона миллий меҳнат тизими” идоралараро дастурий-аппарат комплексини жорий қилиш чора-тадбирлари тўғрисида”ги қарорни имзолади. Қуйида қарорнинг тўлиқ матни билан танишишингиз мумкин. Ўзбекистон Республикаси Президентининг қарори Таъкидлаш жоизки, мамлакатимизда электрон ҳукуматни ривожлантириш ва модернизация қилиш, шу жумладан, маъмурий тартиб-таомилларни такомиллаштириш, аҳоли мурожаатларини кўриб чиқиш жараёнларининг шаффофлиги ва оптималлашувини таъминлаш, фаол тадбиркорликни рағбатлантириш, шунингдек, инвестицион иқлим ва ишбилармонлик муҳитини яхшилашга қаратилган давлат хизматлари кўрсатишни кенгайтириш бўйича изчил чора-тадбирлар кўрилмоқда. Шу билан бирга, рақамли иқтисодиёт ютуқларининг имкониятлари тўла рўёбга чиқарилмаётган қатор соҳалар сақланиб қолмоқда. Хусусан, ижтимоий-меҳнат соҳасида замонавий ахборот технологиялари етарли даражада фаол қўлланилмаяпти. Ҳозирга қадар ташкилотларда кадрлар бўйича иш юритиш асосан қоғоз шаклида амалга оширилмоқда, бу эса ходимнинг, айниқса, пенсия таъминоти ҳуқуқларини расмийлаштиришда меҳнат стажи аниқ ҳисобланишини мураккаблаштиради, шунингдек, аҳоли бандлиги ҳақидаги маълумотларнинг нотўғри кўрсатилишига шароит яратади ва маъмурий бошқарув харажатларини кўпайтиради.',
        },
        {
          name: '2',
          id: 2,
          detail:
            'Ўзбекистон Республикаси Президенти Шавкат Мирзиёев “Ягона миллий меҳнат тизими” идоралараро дастурий-аппарат комплексини жорий қилиш чора-тадбирлари тўғрисида”ги қарорни имзолади. Қуйида қарорнинг тўлиқ матни билан танишишингиз мумкин. Ўзбекистон Республикаси Президентининг қарори Таъкидлаш жоизки, мамлакатимизда электрон ҳукуматни ривожлантириш ва модернизация қилиш, шу жумладан, маъмурий тартиб-таомилларни такомиллаштириш, аҳоли мурожаатларини кўриб чиқиш жараёнларининг шаффофлиги ва оптималлашувини таъминлаш, фаол тадбиркорликни рағбатлантириш, шунингдек, инвестицион иқлим ва ишбилармонлик муҳитини яхшилашга қаратилган давлат хизматлари кўрсатишни кенгайтириш бўйича изчил чора-тадбирлар кўрилмоқда. Шу билан бирга, рақамли иқтисодиёт ютуқларининг имкониятлари тўла рўёбга чиқарилмаётган қатор соҳалар сақланиб қолмоқда. Хусусан, ижтимоий-меҳнат соҳасида замонавий ахборот технологиялари етарли даражада фаол қўлланилмаяпти. Ҳозирга қадар ташкилотларда кадрлар бўйича иш юритиш асосан қоғоз шаклида амалга оширилмоқда, бу эса ходимнинг, айниқса, пенсия таъминоти ҳуқуқларини расмийлаштиришда меҳнат стажи аниқ ҳисобланишини мураккаблаштиради, шунингдек, аҳоли бандлиги ҳақидаги маълумотларнинг нотўғри кўрсатилишига шароит яратади ва маъмурий бошқарув харажатларини кўпайтиради.',
        },
        {
          name: '3',
          id: 3,
          detail:
            'Ўзбекистон Республикаси Президенти Шавкат Мирзиёев “Ягона миллий меҳнат тизими” идоралараро дастурий-аппарат комплексини жорий қилиш чора-тадбирлари тўғрисида”ги қарорни имзолади. Қуйида қарорнинг тўлиқ матни билан танишишингиз мумкин. Ўзбекистон Республикаси Президентининг қарори Таъкидлаш жоизки, мамлакатимизда электрон ҳукуматни ривожлантириш ва модернизация қилиш, шу жумладан, маъмурий тартиб-таомилларни такомиллаштириш, аҳоли мурожаатларини кўриб чиқиш жараёнларининг шаффофлиги ва оптималлашувини таъминлаш, фаол тадбиркорликни рағбатлантириш, шунингдек, инвестицион иқлим ва ишбилармонлик муҳитини яхшилашга қаратилган давлат хизматлари кўрсатишни кенгайтириш бўйича изчил чора-тадбирлар кўрилмоқда. Шу билан бирга, рақамли иқтисодиёт ютуқларининг имкониятлари тўла рўёбга чиқарилмаётган қатор соҳалар сақланиб қолмоқда. Хусусан, ижтимоий-меҳнат соҳасида замонавий ахборот технологиялари етарли даражада фаол қўлланилмаяпти. Ҳозирга қадар ташкилотларда кадрлар бўйича иш юритиш асосан қоғоз шаклида амалга оширилмоқда, бу эса ходимнинг, айниқса, пенсия таъминоти ҳуқуқларини расмийлаштиришда меҳнат стажи аниқ ҳисобланишини мураккаблаштиради, шунингдек, аҳоли бандлиги ҳақидаги маълумотларнинг нотўғри кўрсатилишига шароит яратади ва маъмурий бошқарув харажатларини кўпайтиради.',
        },
        {
          name: '4',
          id: 4,
          detail:
            'Ўзбекистон Респkdjnskdjfnубликаси Президенти Шавкат Мирзиёев “Ягона миллий меҳнат тизими” идоралараро дастурий-аппарат комплексини жорий қилиш чора-тадбирлари тўғрисида”ги қарорни имзолади. Қуйида қарорнинг тўлиқ матни билан танишишингиз мумкин. Ўзбекистон Республикаси Президентининг қарори Таъкидлаш жоизки, мамлакатимизда электрон ҳукуматни ривожлантириш ва модернизация қилиш, шу жумладан, маъмурий тартиб-таомилларни такомиллаштириш, аҳоли мурожаатларини кўриб чиқиш жараёнларининг шаффофлиги ва оптималлашувини таъминлаш, фаол тадбиркорликни рағбатлантириш, шунингдек, инвестицион иқлим ва ишбилармонлик муҳитини яхшилашга қаратилган давлат хизматлари кўрсатишни кенгайтириш бўйича изчил чора-тадбирлар кўрилмоқда. Шу билан бирга, рақамли иқтисодиёт ютуқларининг имкониятлари тўла рўёбга чиқарилмаётган қатор соҳалар сақланиб қолмоқда. Хусусан, ижтимоий-меҳнат соҳасида замонавий ахборот технологиялари етарли даражада фаол қўлланилмаяпти. Ҳозирга қадар ташкилотларда кадрлар бўйича иш юритиш асосан қоғоз шаклида амалга оширилмоқда, бу эса ходимнинг, айниқса, пенсия таъминоти ҳуқуқларини расмийлаштиришда меҳнат стажи аниқ ҳисобланишини мураккаблаштиради, шунингдек, аҳоли бандлиги ҳақидаги маълумотларнинг нотўғри кўрсатилишига шароит яратади ва маъмурий бошқарув харажатларини кўпайтиради.',
        },
        {
          name: '5',
          id: 5,
          detail:
            'Ўзбекистон Республикаси Президенти Шавкат Мирзиёев “Ягона миллий меҳнат тизими” идоралараро дастурий-аппарат комплексини жорий қилиш чора-тадбирлари тўғрисида”ги қарорни имзолади. Қуйида қарорнинг тўлиқ матни билан танишишингиз мумкин. Ўзбекистон Республикаси Президентининг қарори Таъкидлаш жоизки, мамлакатимизда электрон ҳукуматни ривожлантириш ва модернизация қилиш, шу жумладан, маъмурий тартиб-таомилларни такомиллаштириш, аҳоли мурожаатларини кўриб чиқиш жараёнларининг шаффофлиги ва оптималлашувини таъминлаш, фаол тадбиркорликни рағбатлантириш, шунингдек, инвестицион иқлим ва ишбилармонлик муҳитини яхшилашга қаратилган давлат хизматлари кўрсатишни кенгайтириш бўйича изчил чора-тадбирлар кўрилмоқда. Шу билан бирга, рақамли иқтисодиёт ютуқларининг имкониятлари тўла рўёбга чиқарилмаётган қатор соҳалар сақланиб қолмоқда. Хусусан, ижтимоий-меҳнат соҳасида замонавий ахборот технологиялари етарли даражада фаол қўлланилмаяпти. Ҳозирга қадар ташкилотларда кадрлар бўйича иш юритиш асосан қоғоз шаклида амалга оширилмоқда, бу эса ходимнинг, айниқса, пенсия таъминоти ҳуқуқларини расмийлаштиришда меҳнат стажи аниқ ҳисобланишини мураккаблаштиради, шунингдек, аҳоли бандлиги ҳақидаги маълумотларнинг нотўғри кўрсатилишига шароит яратади ва маъмурий бошқарув харажатларини кўпайтиради.',
        },
        {
          name: '',
          id: 6,
          detail:
            'Ўзбекистон Республикаси Президенти Шавкат Мирзиёев “Ягона миллий меҳнат тизими” идоралараро дастурий-аппарат комплексини жорий қилиш чора-тадбирлари тўғрисида”ги қарорни имзолади. Қуйида қарорнинг тўлиқ матни билан танишишингиз мумкин. Ўзбекистон Республикаси Президентининг қарори Таъкидлаш жоизки, мамлакатимизда электрон ҳукуматни ривожлантириш ва модернизация қилиш, шу жумладан, маъмурий тартиб-таомилларни такомиллаштириш, аҳоли мурожаатларини кўриб чиқиш жараёнларининг шаффофлиги ва оптималлашувини таъминлаш, фаол тадбиркорликни рағбатлантириш, шунингдек, инвестицион иқлим ва ишбилармонлик муҳитини яхшилашга қаратилган давлат хизматлари кўрсатишни кенгайтириш бўйича изчил чора-тадбирлар кўрилмоқда. Шу билан бирга, рақамли иқтисодиёт ютуқларининг имкониятлари тўла рўёбга чиқарилмаётган қатор соҳалар сақланиб қолмоқда. Хусусан, ижтимоий-меҳнат соҳасида замонавий ахборот технологиялари етарли даражада фаол қўлланилмаяпти. Ҳозирга қадар ташкилотларда кадрлар бўйича иш юритиш асосан қоғоз шаклида амалга оширилмоқда, бу эса ходимнинг, айниқса, пенсия таъминоти ҳуқуқларини расмийлаштиришда меҳнат стажи аниқ ҳисобланишини мураккаблаштиради, шунингдек, аҳоли бандлиги ҳақидаги маълумотларнинг нотўғри кўрсатилишига шароит яратади ва маъмурий бошқарув харажатларини кўпайтиради.',
        },
        {
          name: '',
          id: 7,
          detail:
            'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Architecto, molestiae!',
        },
        {
          name: '',
          id: 8,
          detail:
            'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Architecto, molestiae!',
        },
        {
          name: '',
          id: 9,
          detail:
            'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Architecto, molestiae!',
        },
        {
          name: '',
          id: 10,
          detail:
            'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Architecto, molestiae!',
        },
      ],
    }
  },
  mounted() {
    this.news.forEach((item) => {
      if (item.id == this.$route.params.id) {
        this.single = item
      }
    })
  },
}
</script>

<style scoped></style>
